src/DataProcessors/РА_ПодсистемаРасчетаБонусовПартнеров_ЗаполнениеБонусовПартнеровВПрошломПериоде/РА_ПодсистемаРасчетаБонусовПартнеров_ЗаполнениеБонусовПартнеровВПрошломПериоде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РА_ПодсистемаРасчетаБонусовПартнеров_ЗаполнениеБонусовПартнеровВПрошломПериоде</name>
</mdclass:DataProcessor>

src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8eac9a31-ed8b-4965-85f9-086b89e1764b">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам</registerRecords>
  <attributes extendedConfigurationObject="e5b27a28-42e1-42b3-806c-83e1fbeb7907">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50c9ead0-2833-4f57-86bb-47fa6ffdc8aa">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

src/Documents/ВозвратТоваровОтКлиента/ВозвратТоваровОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="69907d01-2fac-4a13-a6a2-2cf0af2a60bf">
  <name>ВозвратТоваровОтКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РА_БонусыПартнерам</registerRecords>
  <attributes extendedConfigurationObject="540b6290-f046-4049-ac65-5814b24bea80">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="479ba110-d494-41e5-82d9-be4b089a90d7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

src/Documents/КорректировкаРеализации/КорректировкаРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="69ec59c6-f56d-4522-9097-9fe67516b81d">
  <name>КорректировкаРеализации</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.РА_ПодсистемаРасчетаБонусовПартнеров_БонусыПартнерам</registerRecords>
  <attributes extendedConfigurationObject="e96e43f8-a80c-46e5-bbcf-d05e9b1971fe">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18c7605e-4ee3-4f55-b0af-9844334f5848">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

src/DataProcessors/РА_ПодсистемаРасчетаБонусовПартнеров_ЗаполнениеБонусовПартнеровВПрошломПериоде/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачислитьБонусы(Команда)
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) ИЛИ Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Некорректно заполнен период!");
		Возврат;
	КонецЕсли;
	
	ЕстьОтборы = Ложь;
	
	Если ЗначениеЗаполнено(Партнер) Тогда
		ЕстьОтборы = Истина;
	ИначеЕсли ЗначениеЗаполнено(Договор) Тогда
		ЕстьОтборы = Истина;
	ИначеЕсли ЗначениеЗаполнено(Документ) Тогда
		ЕстьОтборы = Истина;
	КонецЕсли;
	
	Если НЕ ЕстьОтборы Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнены отборы!");
		Возврат;		
	КонецЕсли;	
	
	НачислитьБонусыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НачислитьБонусыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК ДокументСсылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|		РеализацияТоваровУслуг.Дата КАК Дата
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &ОтборПоДоговору
		|					ТОГДА РеализацияТоваровУслуг.Договор = &Договор
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И РеализацияТоваровУслуг.Проведен
		|		И РеализацияТоваровУслуг.Дата >= &ДатаНачала
		|		И РеализацияТоваровУслуг.Дата <= &ДатаОкончания
		|		И ВЫБОР
		|				КОГДА &ОтборПоДокументу
		|					ТОГДА РеализацияТоваровУслуг.Ссылка = &Документ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА &ОтборПоПартнеру
		|					ТОГДА РеализацияТоваровУслуг.Партнер = &Партнер
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВозвратТоваровОтКлиента.Ссылка,
		|		ВозвратТоваровОтКлиента.Дата
		|	ИЗ
		|		Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
		|	ГДЕ
		|		ВозвратТоваровОтКлиента.Проведен
		|		И ВЫБОР
		|				КОГДА &ОтборПоДоговору
		|					ТОГДА ВозвратТоваровОтКлиента.Договор = &Договор
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И ВозвратТоваровОтКлиента.Дата >= &ДатаНачала
		|		И ВозвратТоваровОтКлиента.Дата <= &ДатаОкончания
		|		И ВЫБОР
		|				КОГДА &ОтборПоДокументу
		|					ТОГДА ВозвратТоваровОтКлиента.Ссылка = &Документ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА &ОтборПоПартнеру
		|					ТОГДА ВозвратТоваровОтКлиента.Партнер = &Партнер
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КорректировкаРеализации.Ссылка,
		|		КорректировкаРеализации.Дата
		|	ИЗ
		|		Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|	ГДЕ
		|		КорректировкаРеализации.Проведен
		|		И ВЫБОР
		|				КОГДА &ОтборПоДоговору
		|					ТОГДА КорректировкаРеализации.Договор = &Договор
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И КорректировкаРеализации.Дата >= &ДатаНачала
		|		И КорректировкаРеализации.Дата <= &ДатаОкончания
		|		И ВЫБОР
		|				КОГДА &ОтборПоДокументу
		|					ТОГДА КорректировкаРеализации.Ссылка = &Документ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|		И ВЫБОР
		|				КОГДА &ОтборПоПартнеру
		|					ТОГДА КорректировкаРеализации.Партнер = &Партнер
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Дата";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ОтборПоДоговору", ЗначениеЗаполнено(Договор));
	Запрос.УстановитьПараметр("ОтборПоДокументу",?(Документ <> Неопределено И Не Документ.Пустая(), Истина, Ложь));
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ОтборПоПартнеру", ЗначениеЗаполнено(Партнер));
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокументОбъект = ВыборкаДетальныеЗаписи.ДокументСсылка.ПолучитьОбъект();
		РА_ПодсистемаРасчетаБонусовПартнеров_РасчетБонусовСервер.ОбработатьНачислениеБонусов(ДокументОбъект, Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
